#include "game.h"
#include "board.h"
#include "ships.h"
#include "set.h"
#include "move.h"

#include <iostream>
using std::cout, std::cin;

//void Game::printRulesOrStart() {
//     cout << "---------------------------------------------Вітаємо Вас у грі 'Морський бій'-------------------------------------------" << '\n';
//    cout << ""<< '\n';
//    int choose;
//     cout << "Введіть 1, щоб читати правила гри або 2 для її початку: " << '\n';
//    do {
//         cin >> choose;
//        if (choose != 1 && choose != 2) {
//             cout << "Невірне значення, введіть 1 чи 2" << '\n';
//        }
//    } while (choose != 1 && choose != 2);
//
//
//    if (choose == 1) {
//         printRules();
//        char start;
//         cin >> start;
//    }
//    system("cls");
//}
//
void Game::printRules(){
    system("cls");
    cout << "1. Як розміщувати кораблі? "<< '\n';
    cout << "   Потрібно ввести 4 символи: "<< '\n';
    cout << "     1-ий це тип корабля (1, 2, 3 або 5)"<< '\n';
    cout << "     2-ий це буква, що відповідає за горизонтальну координату"<< '\n';
    cout << "     3-ій це цифра, що відповідає за вертикальну координату"<< '\n';
    cout << "     4-ий це буква, що відповідає за напрям корабля 'V'(вертикальний)"<< '\n';
    cout << "     чи 'H' - горизонтальний"<< '\n';
    cout << ""<< '\n';
    cout << "2. Як здійснювати ходи"<< '\n';
    cout << "   Потрібно ввести два символи, букву та цифру координати"<< '\n';
    cout << "   Гра закінчиться коли усі кораблі якогось гравця буде потоплено"<< '\n';
    cout << ""<< '\n';
    cout << "Введіть будь який символ щоб почати гру"<< '\n';
}
//
//int Game::chooseGameMode() {
//        int choose;
//        std::cout << "Для початку оберіть режим гри:\n   1 - гравець проти гравця\n   2 - гравець проти комп'ютера" << '\n';
//        while (true) {
//            std::cin >> choose;
//            if (choose == 1 || choose == 2) {
//                system("cls");
//                gameMode = (choose == 1);
//                break;
//            } else {
//                std::cout << "Неправильне значення. Спробуйте ще раз." << '\n';
//            }
//        }
//        return choose;
//    }
